{
  "spa_services": [
    {
      "service_type": "Full Facials",
      "services": [
        {
          "type": "Full Facials",
          "service_name": "Hydro Glowskin Brightening Facial",
          "description": "This advanced facial combines hydra dermabrasion, micro-current technology, LED light therapy, and radio frequency for visibly brighter and firmer skin. It deeply cleanses, hydrates, and rejuvenates while improving fine lines, wrinkles, and skin texture. The treatment promotes skin tightening and lifting for a radiant, youthful glow. Ideal for dull, tired, or aging skin.",
          "price": 150.0
        },
        {
          "type": "Full Facials",
          "service_name": "LED Light Therapy Facial",
          "description": "This non-invasive facial uses targeted LED light to treat a variety of skin concerns including acne, pigmentation, wrinkles, rosacea, and sun damage. The therapy stimulates collagen production and supports skin healing at a cellular level. It helps calm inflammation while improving tone and texture. Suitable for all skin types, including sensitive skin.",
          "price": 90.0
        },
        {
          "type": "Full Facials",
          "service_name": "Microdermabrasion Facial",
          "description": "A gentle yet effective exfoliating treatment that removes dead skin cells to reveal smoother, brighter skin. This facial helps reduce the appearance of fine lines, mild acne scars, enlarged pores, and uneven texture. It also boosts circulation and enhances product absorption. Perfect for refreshing dull or congested skin.",
          "price": 90.0
        },
        {
          "type": "Full Facials",
          "service_name": "Advanced Exfoliation - Pumpkin Facial",
          "description": "This powerful exfoliating facial uses natural pumpkin enzymes and antioxidants to resurface and renew the skin. It is designed to improve signs of aging, acne, and hyperpigmentation while promoting a healthy glow. The treatment boosts cell turnover and refines skin texture. Ideal for those seeking visible results with minimal downtime.",
          "price": 80.0
        },
        {
          "type": "Full Facials",
          "service_name": "Hyperpigmentation/ Melasma Facial",
          "description": "This targeted facial is designed to reduce dark spots, uneven skin tone, and melasma. It combines gentle exfoliation, brightening ingredients, and soothing techniques to promote a more even complexion. Regular treatments help improve clarity and restore skin radiance. Suitable for pigmentation-prone and sun-damaged skin.",
          "price": 80.0
        },
        {
          "type": "Full Facials",
          "service_name": "Acne Skin Treatment Facial",
          "description": "A deep-cleansing facial specifically formulated to treat acne-prone and congested skin. It focuses on purifying pores, reducing excess oil, calming inflammation, and preventing future breakouts. The treatment helps improve skin clarity while supporting healing. Ideal for teens and adults struggling with acne.",
          "price": 80.0
        },
        {
          "type": "Full Facials",
          "service_name": "Back Facial",
          "description": "This relaxing and results-driven treatment provides complete care for the back. It includes steaming, deep cleansing, exfoliation, extractions (if needed), and a soothing back and neck massage. Designed to treat acne, dryness, and congestion, it leaves your skin smooth and refreshed. Perfect for special occasions or regular maintenance.",
          "price": 75.0
        },
        {
          "type": "Full Facials",
          "service_name": "Facial with Extractions",
          "description": "This customized facial includes thorough cleansing, exfoliation, and professional extractions to remove blackheads and whiteheads safely. It helps unclog pores, reduce breakouts, and improve skin texture. The treatment finishes with calming and hydrating products to soothe the skin. Ideal for congested or combination skin.",
          "price": 60.0
        },
        {
          "type": "Full Facials",
          "service_name": "Classic( No black heads & white head removal)",
          "description": "A relaxing and nourishing facial designed to refresh and hydrate the skin without extractions. It includes cleansing, exfoliation, massage, and a customized mask to improve skin health and glow. Perfect for maintaining healthy skin or first-time facial clients. Suitable for all skin types.",
          "price": 50.0
        },
        {
          "type": "Full Facials",
          "service_name": "The Express Facial",
          "description": "The Experess Facial offers a swift and effective treatment designed to rejuvenate your skin,enhancing both tone and texture.This service focuses on essential steps that deliver immediate result,making it perfect for those with busy schedules seeking a quick refresh.",
          "price": 55.0
        },
        {
          "type": "Full Facials",
          "service_name": "Golden Honey Nourishing Brightening Facial",
          "description": "This Luxurios golden - hued facial ,designed to hydrate ,soothe ,and replenish tired, stressed comlpexions. ,& in this facial Lemon Zest Enzime contains lemon, 8% arbutin , 6% lactic acid ,3% glycolic acidand 2% kojic acid.Skin Type:- Dry , Mature, Skin with pigmentation.",
          "price": 70.0
        },
        {
          "type": "Full Facials",
          "service_name": "Pineapple Honey Signature Facial",
          "description": "This signature facial features Pineapple Enzyme, an award-winning, fruit-forward exfoliant ideal for dull, rough, or breakout-prone skin. Gentle enzymatic exfoliation with naturally occurring bromelain and papain helps refine texture and support visible skin renewal. The treatment is completed with a Golden Honey Nourishing Mask, a luxurious peptide-powered formula that delivers deep hydration while restoring moisture balance. Perfect for a brightening refresh or a pre-event glow.Skin Type: All",
          "price": 70.0
        },
        {
          "type": "Full Facials",
          "service_name": "Hydro gelly Mask",
          "description": "This deeply hydrating Hydro Gelly Mask provides powerful antioxidant protection while soothing and calming the skin. It helps promote skin repair and regeneration, leaving the complexion refreshed, plump, and radiant. Ideal for all skin types, including sensitive skin.",
          "price": 12.0
        },
        {
          "type": "Full Facials",
          "service_name": "Add-on: Face bleach",
          "description": "This add-on treatment gently lightens facial hair to create a brighter, more even-looking complexion. Helps enhance skin clarity and smoothness, making makeup application flawless. Ideal as a complement to any facial service.",
          "price": 10.0
        },
        {
          "type": "Full Facials",
          "service_name": "Add-On: Advanced Facial Machine Tools",
          "description": "Enhance your facial with advanced skincare technologies tailored to your skin’s needs. Choose from Microdermabrasion, LED Light Therapy, Radio Frequency (RF), or Microcurrent Therapy to boost results. These targeted add-ons help improve skin texture, tone, firmness, and overall radiance.",
          "price": 25.0
        }
      ]
    },
    {
      "service_type": "Waxing",
      "services": [
        {
          "type": "Waxing",
          "service_name": "Brow Shaping",
          "description": "A precision brow waxing service designed to enhance your natural brow shape. Removes unwanted hair for clean, defined brows that frame your face beautifully. Finished with soothing products to minimize redness.",
          "price": 15.0
        },
        {
          "type": "Waxing",
          "service_name": "Brow Maintenance",
          "description": "Perfect for maintaining already-shaped brows. This quick touch-up removes stray hairs and keeps your brows neat and polished. Ideal between full shaping appointments.",
          "price": "Starting at $15.00"
        },
        {
          "type": "Waxing",
          "service_name": "Full Face",
          "description": "A complete facial waxing service that removes unwanted hair from the brows, upper lip, chin, cheeks, and sideburns. Leaves skin smooth, fresh, and makeup-ready. Suitable for all skin types with gentle waxing techniques.",
          "price": 35.0
        },
        {
          "type": "Waxing",
          "service_name": "Lips",
          "description": "Gently removes unwanted hair from the upper lip area for smooth, clean skin. The treatment is quick and effective with minimal discomfort. Finished with calming products to soothe the skin.",
          "price": 5.0
        },
        {
          "type": "Waxing",
          "service_name": "Chin",
          "description": "Targets unwanted hair on the chin area for a smooth and polished look. Helps prevent ingrown hairs and irritation compared to shaving. Ideal for regular maintenance.",
          "price": 8.0
        },
        {
          "type": "Waxing",
          "service_name": "Lip and Chin",
          "description": "A combination service that removes unwanted hair from both the upper lip and chin. Leaves the skin smooth and refreshed with longer-lasting results. Perfect for convenient facial hair maintenance.",
          "price": 12.0
        },
        {
          "type": "Waxing",
          "service_name": "Side-Burns",
          "description": "Removes unwanted hair along the side-burn area for a clean and defined facial contour. Helps create a smoother, more balanced appearance. Gentle techniques ensure comfort.",
          "price": 10.0
        },
        {
          "type": "Waxing",
          "service_name": "Underarms",
          "description": "Removes hair from the underarm area for smooth, clean skin. Helps reduce hair regrowth over time and keeps you feeling fresh longer. Suitable for sensitive skin.",
          "price": 15.0
        },
        {
          "type": "Waxing",
          "service_name": "Full Arms",
          "description": "Removes hair from shoulders to wrists for silky-smooth arms. Leaves skin soft and even with longer-lasting results than shaving. Great for a polished look year-round.",
          "price": 40.0
        },
        {
          "type": "Waxing",
          "service_name": "Half Arms",
          "description": "Targets either the upper or lower arms to remove unwanted hair. Ideal for clients looking for smooth skin with minimal maintenance. Finished with soothing care for comfort.",
          "price": 30.0
        },
        {
          "type": "Waxing",
          "service_name": "Full Legs",
          "description": "Complete hair removal from thighs to ankles for ultra-smooth legs. Provides long-lasting results and softer regrowth. Perfect for vacations, special occasions, or regular upkeep.",
          "price": 50.0
        },
        {
          "type": "Waxing",
          "service_name": "Half Legs",
          "description": "Removes hair from either the upper or lower leg area. Leaves skin smooth and refreshed with longer-lasting results than shaving. A great option for quick maintenance.",
          "price": 40.0
        },
        {
          "type": "Waxing",
          "service_name": "Chest",
          "description": "Removes unwanted hair from the chest area for a clean and groomed appearance. Performed with professional techniques to minimize irritation. Suitable for all hair types.",
          "price": 20.0
        },
        {
          "type": "Waxing",
          "service_name": "Stomach",
          "description": "Targets unwanted hair from the stomach area for smooth, clean skin. Helps create a more polished look with longer-lasting results. Finished with calming products.",
          "price": 20.0
        },
        {
          "type": "Waxing",
          "service_name": "Back",
          "description": "Removes hair from the full back area for smooth, refreshed skin. Ideal for reducing irritation caused by shaving or trimming. Leaves skin clean and well-groomed.",
          "price": 30.0
        },
        {
          "type": "Waxing",
          "service_name": "Bikini Line",
          "description": "Removes unwanted hair along the bikini line for a clean, natural finish. Designed to stay within the swimsuit line while keeping skin smooth. Gentle and hygienic techniques used.",
          "price": 30.0
        },
        {
          "type": "Waxing",
          "service_name": "Brazilian",
          "description": "Removes most or all hair from the bikini area, including front and back, based on your preference. Leaves skin smooth and fresh with longer-lasting results. Performed with care for comfort and hygiene.",
          "price": 60.0
        },
        {
          "type": "Waxing",
          "service_name": "Full Body",
          "description": "A comprehensive waxing service covering multiple areas of the body for head-to-toe smoothness. Ideal for those looking for complete hair removal in one session. Leaves skin silky and polished.",
          "price": "Starting at $250.00"
        },
        {
          "type": "Waxing",
          "service_name": "Ear Waxing",
          "description": "Safely and effective remove unwanted hair from the outer ear and lobe area with our professional ear waxing service.",
          "price": 10.00
        },
        {
          "type": "Waxing",
          "service_name": "Nose Waxing",
          "description": "Quickly and effectively remove unwanted nose hair with our professional nose waxing service for a cleaner and more polished look.",
          "price": 10.00
        },
        {
          "type": "Waxing",
          "service_name": "First Time Brazillian Wax",
          "description": "Newcomers to our salon can enjoy a smooth and comfortable waxing experience at an exclusive introductory price .We focus on creating a welcoming and stress free atmosphere. Take advantage of this special offer to discover our high quality techniques and achieve long -lasting smoothness.",
          "price":  50.00
        }
      ]
    },
    {
      "service_type": "Threading",
      "services": [
        {
          "type": "Threading",
          "service_name": "Brow shaping",
          "description": "An artful brow threading service designed to sculpt and define your natural brow shape with precision. This gentle, chemical-free technique creates clean lines while being kind to sensitive skin. Finished with soothing care for a refined, polished look.",
          "price": 12.0
        },
        {
          "type": "Threading",
          "service_name": "Brow maintenance",
          "description": "A refined touch-up service to maintain beautifully shaped brows. Removes fine regrowth and stray hairs with expert precision for a consistently flawless appearance. Ideal for preserving brow definition between shaping sessions.",
          "price": 10.0
        },
        {
          "type": "Threading",
          "service_name": "Full Face",
          "description": "A luxurious full-face threading experience that removes unwanted hair from the brows, upper lip, chin, cheeks, and sideburns. This ancient technique delivers smooth, radiant skin while enhancing facial contours. Perfect for those seeking a clean, flawless complexion.",
          "price": 30.0
        },
        {
          "type": "Threading",
          "service_name": "Lips",
          "description": "A delicate threading service that precisely removes unwanted hair from the upper lip area. Leaves skin smooth, refined, and makeup-ready without the use of chemicals. Ideal for sensitive skin types.",
          "price": 5.0
        },
        {
          "type": "Threading",
          "service_name": "Chin",
          "description": "Targets unwanted chin hair with exceptional accuracy for a smooth, polished finish. This gentle technique minimizes irritation while delivering long-lasting results. Leaves the skin clean, soft, and refined.",
          "price": 8.0
        },
        {
          "type": "Threading",
          "service_name": "Lips and Chin",
          "description": "A perfectly paired service that removes unwanted hair from both the upper lip and chin. Offers precise results with a smooth, elegant finish. Ideal for maintaining a flawless and well-groomed appearance.",
          "price": 12.0
        },
        {
          "type": "Threading",
          "service_name": "Side Burns",
          "description": "A precision threading service designed to clean and define the side-burn area. Enhances facial balance and creates a smooth, contoured look. Finished with calming care for a luxurious experience.",
          "price": 10.0
        }
      ]
    },
    {
      "service_type": "Massage",
      "services": [
        {
          "type": "Massage",
          "service_name": "Hot Stone Massage - 20 Minutes",
          "description": "Indulge in a deeply relaxing hot stone massage designed to melt away tension and restore balance. Warm, smooth stones are gently placed and massaged over key areas to ease muscle stiffness, improve circulation, and promote deep relaxation. This luxurious 20-minute treatment is perfect for a quick yet rejuvenating escape, leaving you feeling calm, refreshed, and renewed.",
          "price": 25.0
        }
      ]
    },
    {
      "service_type": "Hands Heena ( Mehndi) Tattoo",
      "services": [
        {
          "type": "Hands Heena ( Mehndi) Tattoo",
          "service_name": "Hands Heena Tattoo",
          "description": "Experience the beauty of traditional artistry with a luxurious hand henna tattoo application. Using natural, skin-safe henna, intricate designs are carefully crafted to enhance the elegance of your hands. This relaxing and artistic service leaves you with a rich, temporary stain that deepens beautifully over time, perfect for celebrations, special occasions, or personal expression.",
          "price": 20.0
        }
      ]
    }
  ]
}
